''' Визначте функцію print_to, яка приймає одне натуральне число n і роздруковує на екрані послідовність цілих чисел від
1 до n до включно. Кожне число необхідно виводити в окремому рядку.'''

# def print_to(n):
#     if n == 1:
#         print(n)
#     else:
#         print_to(n - 1)
#         print(n)
#
#
# print_to(4)

'''Дано натуральне число N і послідовність з N елементів. Потрібно вивести цю послідовність у зворотному порядку.
Вхідні дані:
Програма приймає на вхід натуральне число N (N ≤ 1000). У другому рядку через пропуск йдуть N цілих чисел, 
які за модулем не перевищують 1000 - елементи послідовності.
Вихідні дані:
Ваше завдання вивести задану послідовність у зворотному порядку.'''

# def reverse_list(a):
#     if len(a) == 0:
#         return []
#     else:
#         return [a[-1]] + reverse_list(a[:-1])
#
# n = int(input())
# a = list(map(int, input().split()))
#
# result = reverse_list(a)
#
#
# for x in result:
#     print(x, end=' ')

'''Числа Фібоначчі
Послідовністю Фібоначчі називається послідовність чисел a0, a1, ..., ..., an, ..., де число, що стоїть на n-ій позиції 
можна обчислити за формулою:
Потрібно знайти N-те число Фібоначчі.
Вхідні дані
Програмі надходить на вхід ціле число N (0 ≤ N ≤ 30) - порядковий номер числа Фібоначчі.
Вихідні дані
Вам необхідно вивести на екран N-те число Фібоначчі.'''

# def fibonacci(n):
#     if n == 1:
#         return 0
#     elif n == 2:
#         return 1
#     return fibonacci(n-1) + fibonacci(n-2)
#
# print(fibonacci(20))

'''Напишіть функцію, яка приймає на вхід список із цілих чисел і повертає суму елементів 
переданого списку.'''

# def sum_list(l:list):
#     if len(l) == 0:
#         return 0
#     else:
#         return l[0] + sum_list(l[1:])
#
# print(sum_list([1, 5, 8]))

'''Уявіть, що у нас є список цілих чисел необмеженої вкладеності. Тобто наш список може складатися зі списків, 
усередині яких також можуть бути списки. Ваше завдання перетворити все це на лінійний список за допомогою функції flatten'''

# def flatten(l:list):
#     result = []
#     for i in l:
#         if isinstance(i, list):
#             result.extend(flatten(i))
#         else:
#             result.append(i)
#     return result
#
# print(flatten([1, [8], 4, [4, [5]]]))